In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

data2 = pd.read_csv('https://github.com/patilankita79/ML_DataPreprocessing/raw/master/ML_DataPreprocessing/Data.csv')
data2.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [2]:
data2.dtypes

Country       object
Age          float64
Salary       float64
Purchased     object
dtype: object

In [3]:
data2.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [4]:
data2=data2.dropna()
print(data2)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [6]:
# Dealing with categorical data ----> LabelEncoder
import sklearn
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
encode_cols=['Country','Purchased']
for col in encode_cols:
    data2[col]=le.fit_transform(data2[col])
data2.head()

   Country   Age   Salary  Purchased
0        0  44.0  72000.0          0
1        2  27.0  48000.0          1
2        1  30.0  54000.0          0
3        2  38.0  61000.0          0
5        0  35.0  58000.0          1

In [7]:
# Scaling the features
import sklearn
from sklearn.preprocessing import MinMaxScaler
sc=MinMaxScaler(feature_range=(0,1))

scal_cols=['Age','Salary']
data2[scal_cols]=sc.fit_transform(data2[scal_cols])
data2.head()

   Country       Age    Salary  Purchased
0        0  0.739130  0.685714          0
1        2  0.000000  0.000000          1
2        1  0.130435  0.171429          0
3        2  0.478261  0.371429          0
5        0  0.347826  0.285714          1

In [8]:
# Splitting dataset into Training and Testing Sets
import sklearn
from sklearn.model_selection import train_test_split

x=data2.drop('Purchased', axis=1)
y=data2['Purchased']

x_train, x_test, y_train, y_test= train_test_split( x, y, test_size=0.2, random_state=0)
print(x_train)
print('------------------------------')
print(x_test)
print('------------------------------')
print(y_train)
print('------------------------------')
print(y_test)

   Country       Age    Salary
1        2  0.000000  0.000000
9        0  0.434783  0.542857
3        2  0.478261  0.371429
0        0  0.739130  0.685714
7        0  0.913043  0.885714
5        0  0.347826  0.285714
------------------------------
   Country       Age    Salary
8        1  1.000000  1.000000
2        1  0.130435  0.171429
------------------------------
1    1
9    1
3    0
0    0
7    1
5    1
Name: Purchased, dtype: int64
------------------------------
8    0
2    0
Name: Purchased, dtype: int64